{
  "greetings": "Hello World!",
  "settingTitle": "Settings",
  "language": "Language",
  "theme": "Theme",
  "detail": "More Details",
  "exampleDetail": "This is a detailed text.",
  "detailHelpText": "This option serves to reveal or hide additional details about my professional life, as well as hobbies and other experiences not directly related to the field of technology.",
  "stack": "My Stack",
  "tools":"OTHERS",

  "myServices": "My Services",
    "makeSiteService": "Website Development",
    "freeLanceService": "Freelance on Demand",
    "makeDocService": "Technical Documentation",
    "maintenanceService": "Website Maintenance",
  
  "contact":"Contact",
  "contactFragment1": "Or just copy by clicking on",
  "contactFragment2": "or",
  "copied":"Copied",
  "phone":"Phone",

  "portfolioHeader": "My Projects",
  
  "vanillaJSDescription":"Section dedicated to my projects using basic technologies such as HTML, CSS, and JavaScript.",
  "reactJSDescription":"Section dedicated to my projects using technologies such as React, Styled Components, TypeScript and others.",

  "projectDetails": "Click for more Details",
  "projectTechs": "Technologies",
  "previewButton":"Preview",
  "repoButton":"Project",
    "unknownProject":"Unkown Project.",
    "iFoodProject":"This project was developed during the Front-End Development track of the Ada.Tech course.",
    "iFoodProjectFullDescription":"This project was developed during the Front-End Development track of the Ada.Tech course. The objective of this exercise was to emulate a landing page for iFood, utilizing essential front-end development technologies such as HTML and CSS. Following a single-page structure, also known as SPA, the goal was to create a responsive layout that served as a foundation for fundamental development techniques. It is also important to highlight its static nature, as the exercise was carried out without the use of JavaScript in its implementation.",

    "chaveiroGelsonProject": "My first commercial project. Aimed at presenting the company's services...",
    "chaveiroGelsonProjectFullDescription": "My first commercial project. Aimed at presenting the company's services. The project's proposal was, in addition to providing a business card for Chaveiro Gelson, with its offered services and location, to also provide a simple and efficient system for creating quotes. To do this, the WhatsApp API was used, where, through a card system, a customer visiting the page could build a well-structured quote, which would be submitted via the company's WhatsApp. The entire page manipulation was done using 'pure' JavaScript.",

    "toDoProject": "This project was developed as a group exercise during the Ada.Tech course...",
    "toDoProjectFullDescription": "This project was developed as a group exercise during the Ada.Tech course. During the dynamic front-end module, it was proposed that each trio develop a ToDo web app. In partnership with my colleagues Rodrigo Silva and Wild Barreto, we developed a simple system that, in addition to allowing task registration, also enables editing, completion, and deletion of tasks, with the differentiator of having persistent storage, using the browser's localStorage for data persistence.",

    "thisPortfolioProject": "(...) built not only to demonstrate the progression of my React skills...",
    "thisPortfolioProjectFullDescription": "My most recent project, this very page, was built not only to showcase the progression of my React skills but primarily to demonstrate other aspects that go beyond 'Lucas Developer.' In addition to a more advanced use of React, the page was built using libraries like typeIt, CSS animations, all to bring more dynamism. The CSS was entirely worked with styled components, and there was extensive use of contexts, both for page translation, styling, and even for presenting sections not directly related to my work as a developer. Additionally, great care was taken in working on the page's responsiveness, ensuring that it adapts to any type of screen.",

    "todoTrackerProject": "The To-do Tracker was the natural evolution of my previous work on to-do lists...", 
    "todoTrackerProjectFullDescription": "The To-do Tracker was the natural evolution of my previous work on to-do lists. In it, I had the opportunity to deepen my knowledge in React while developing a useful tool to continue my studies as a developer. The idea behind this app is not only to organize task lists within their respective projects and/or works but also to track (manually) the time dedicated to each task. Additionally, it allows you to view the total time for a project/work by summing the time spent on each task. Lastly, and not less importantly, it is possible to make pricing estimations for the work and filter tasks by date, with the help of react-calendar.",

    "portfolioV01Project": "The old version of my portfolio was my first major attempt with React.",
    "portfolioV01ProjectFullDescription": "The old version of my portfolio was my first major attempt with React. At the time, my knowledge of the library was still very superficial, which led to frequent direct DOM manipulations using vanilla JavaScript. Nevertheless, I achieved a relatively satisfactory result in its construction. The project was originally hosted on GitHub Pages and was essentially structured as a single-page application, with navigation through section IDs.",

  "resumeTitle":"About Me",

  "cvLink":"https://drive.google.com/file/d/1dHpouh-Hv0aFN5WYqP66vU_5XWXinRXk/view?usp=sharing",

  "aboutMeSection":"Introduction",
  "aboutMe": "I am a web developer from Pelotas, RS, with a background in building technology and architecture, but always focused on technology. Throughout my journey, I explored 3D printing and honed my problem-solving skills. Recently, I completed the Front-End Development course at Ada.Tech and also took an introduction to web development at Faculdade Descomplica. I am curious and a generalist, with experience in HTML5, CSS3, JavaScript, React, Styled Components, and Bootstrap.",

  "educationSection":"Education",
    
    "educationDegree":"Bachelor's Degree in Architecture and Urbanism",
    "educationDegreeInstituition":"Federal University of Pelotas",
    "educationDegreeYear":"(2013 - 2023)",
    "educationDegreeDetail":"Degree in Architecture and Urbanism, with extensive experience in the field of urban planning, especially in the use of GIS technologies for georeferenced mapping.",
    
    "educationTechnical": "Building Technician",
    "educationTechnicalInstituition": "Federal Institute of Rio Grande do Sul",
    "educationTechnicalYear": "(2009 - 2013)",
    "educationTechnicalDetail": "Training as a building technician, completed in an integrated format with high school.",

  "professionalSection":"Professional Experience",
    
    "itTechnician":"I.T. Technician",
    "itTechnicianCompany":"Self-Employed",
    "itTechnicianYear":"(2022 - Present)",
    "itTechnicianDetail":"Services for Desktops and Laptops: Formatting and Refurbishing, Assembly, Cleaning, and Maintenance",

    "operationalAssistant":"Operational Assistant",
    "operationalAssistantCompany":"Brazilian Postal and Telegraph Company",
    "operationalAssistantYear":"(2024 - 2025)",
    "operationalAssistantDetail":"Assistance in sorting and logistics for the distribution of textbooks to municipal and state schools in Pelotas and the surrounding region.",

    "mailCarrier":"Mail Carrier",
    "mailCarrierCompany":"Brazilian Postal and Telegraph Company",
    "mailCarrierYear":"(2024)",
    "mailCarrierDetail":"Works as a package and mail delivery driver, in addition to assisting in package sorting, both for distribution within the city of Pelotas and for dispatch to other locations.",

    "pontoX":"Intern",
    "pontoXCompany":"Ponto X - Architecture",
    "pontoXYear":"(2021 - 2022)",
    "pontoXDetail":"Execution of technical drawings, architectural and interior design projects, 3D modeling and rendering, as well as coordination of the intern team.",

    "gelsonProject":"Website do Chaveiro Gelson",
    "gelsonProjectDetail": "Page developed with vanilla technologies (HTML, CSS, and pure JavaScript), to showcase the company's services, also featuring a tool to simplify the budgeting process for clients, through the use of the WhatsApp API.",

    "gelsonCompany":"Attendant and Locksmith",
    "gelsonCompanyCompany":"Chaveiro Gelson",
    "gelsonCompanyYear":"(2019 - 2021)",
    "gelsonCompanyDetail":"Counter attendant services, key duplication, and residential and automotive lockouts.",

    "internUrbanMetrics":"Academic Intern - UrbanMetrics Help",
    "internUrbanMetricsCompany":"FAUrb Urban Lab",
    "internUrbanMetricsYear":"(2020 - 2021)",
    "internUrbanMetricsDetail":"Co-authorship, writing, and editing of the Help for the UrbanMetrics software, based on the studies of Professor Maurício Polidori, on urban topological measures.",
    "helpAccess":"Click here to Help file.",

    "gersonZaffalon":"Intern",
    "gersonZaffalonCompany":"Gerson Zaffalon - Architecture",
    "gersonZaffalonYear":"(2019 - 2020)",
    "gersonZaffalonDetail":"Execution of technical drawings, architectural and interior design projects, 3D modeling and rendering.",

    "hervalPlanning":"Academic Intern - Urban Planning of Herval",
    "hervalPlanningCompany":"FAUrb Urban Lab",
    "hervalPlanningYear":"(2019)",
    "hervalPlanningDetail":"Conducting field surveys, studying population and demographic data, as well as creating maps and producing georeferenced content in partnership with the Herval city hall.",

    "fuelStation":"Fuel Station Attendent",
    "fuelStationCompany":"Posto da Rótula",
    "fuelStationYear":"(2018 - 2019)",
    "fuelStationDetail":"Customer service. Fueling and cleaning vehicles.",

    "candiotaPlanning":"Intern - Urban Planning of Candiota",
    "candiotaPlanningCompany":"FAUrb Urban Lab",
    "candiotaPlanningYear":"(2018)",
    "candiotaPlanningDetail":"Conducting field surveys, studying population and demographic data, as well as creating maps and producing georeferenced content in partnership with the Candiota city hall.",

    "chuyPlanning":"Intern - Urban Planning of Chuy",
    "chuyPlanningCompany":"FAUrb Urban Lab",
    "chuyPlanningYear":"(2017)",
    "chuyPlanningDetail":"Conducting field surveys, studying population and demographic data, as well as creating maps and producing georeferenced content in partnership with the Chuy city hall.",

    "internLab":"Intern - Lab Assistant",
    "internLabCompany":"FAUrb Urban Lab",
    "internLabYear":"(2016)",
    "internLabDetail":"Maintenance and assistance with the use of computers and laboratory equipment, as well as inventory management and access control for professors and students.",

    "atelieIntern":"Intern",
    "atelieInternCompany":"Ateliê Architecture",
    "atelieInternYear":"(2014)",
    "atelieInternDetail":"Execution of technical drawings, architectural and interior design projects, 3D modeling and rendering.",

    "martinsIntern":"Intern",
    "martinsInternCompany":"Engineer Martins' Office",
    "martinsInternYear":"(2012 - 2013)",
    "martinsInternDetail":"Drafting of technical drawings. Execution of GIS data processing and organization of documentation for regulation with INCRA.",

  "freeEducationSection":"Courses and Certifications",

  "certificateAccess":"Click here to certificates.",

    "adaTech":"Vem Ser Tech - Front-End Development Program",
    "adaTechCompany":"Ada.Tech",
    "adaTechYear":"(2023 - 2024)",
    "adaTechDetail":"Extensive course covering Static and Dynamic Web Project disciplines, including the use of technologies such as TypeScript, Bootstrap, and React.",

    "descomplica":"Introduction to Front-End Development",
    "descomplicaCompany":"Faculdade Descomplica",
    "descomplicaYear":"(2023)",
    "descomplicaDetail":"Introduction to Web Development, with a special focus on static pages and essential technologies such as HTML, CSS, and JavaScript.",
    
    "origamidUIBegin": "UI Design para Iniciantes",
    "origamidUIBeginCompany":"Origamid",
    "origamidUIBeginYear":"(2024)",
    "origamidUIBeginDetail":"UI Design course for beginners, covering basic and advanced interface design concepts, starting from scratch and using tools like Figma for prototype creation.",

  "skillsSection":"My Skills",
    "hardSkills":"Technical",
    "softSkills":"Socials",

    "softSkillResilience": "Resilience",
    "softSkillResilienceDetail": "Adaptability and perseverance to turn challenges into opportunities, maintaining a focus on effective solutions and continuous learning.",
    "softSkillTeamWork": "Teamwork",
    "softSkillTeamWorkDetail": "Effective collaboration, clear communication, and commitment to collective goals, always striving for a productive and harmonious environment.",
    "softSkillGeneralism":"Generalism",
    "softSkillGeneralismDetail": "Versatile and adaptable, with broad knowledge that enables effective problem-solving across different areas.",
    "softSkillOrganization":"Sense of Organization",
    "softSkillOrganizationDetail":"Ability to structure tasks and manage time effectively, ensuring that processes run smoothly and priorities are met without compromising quality.",
    "softSkillAccountability":"Accountability",
    "softSkillAccountabilityDetail":"Commitment to fulfilling tasks with accountability, ensuring that objectives are met and taking ownership of outcomes and decisions.",
    "softSkillsLanguage":"Languages",
    "softSkillsLanguageDetail":"Besides my native Portuguese, I have an intermediate level in English and Spanish.",

  "personalProjects":"Personal Projects & Hobbies",
    "bgdProject": "BoardGameDay!",
    "bgdProjectDetail1": "Since a young age, I've always enjoyed games of all kinds. With the arrival of the pandemic in 2020, and its restrictions, my interest in board games intensified.",
    "bgdProjectDetail2": "During the lockdown at home with my family, I began building a great collection. This, combined with visits to a local board game store (which became more frequent with the end of the pandemic), Cúpula do Trovão, was the perfect trigger for the creation of the 'BoardGameDay' event, which, with few exceptions, takes place once a month at the same store.",
    "bgdProjectDetail3": "The project is organized in partnership with my friend Luca and the store management, which provides the space for us to gather board game enthusiasts and also introduce the hobby to new players.",
    "bgdProjectDetail4": "I recognize that participating in the hobby has brought me many benefits. Besides being a great 'escape valve', it is also a wonderful opportunity to develop social skills, as well as work on logical reasoning and memorization.",
    "bgdFigCaption": "Collection available at the event.",

  "tesseractProject": "Tesseract_Lab",
    "tesseractProjectDetail1": "During the pandemic, I deepened my studies in 3D printing, specifically in the FDM (Fused Deposition Modeling) method.",
    "tesseractProjectDetail2": "I started with a basic 3D printer, the EasyThreed X1, which worked exclusively with PLA filaments, a material with a melting temperature of around 190°C. This simple device lacked a heated bed or an emergency system to handle clogs, which later resulted in a serious motor failure.",
    "tesseractProjectDetail3": "Later, I had the opportunity to collaborate with Cúpula do Trovão (the same board game store mentioned earlier) in the development of RPG miniatures, using the Ender-3, one of the most popular entry-level 3D printers at the time.",
    "tesseractProjectDetail4": "At the same time, I also worked with a more advanced machine, the GT-Max3D H5 CORE, which featured a much larger print volume and an advanced interface for real-time print management. This experience came through a collaboration with my Architecture and Urbanism course, which had two key goals: to gain in-depth knowledge about the equipment so it could be passed on to future students, and to assess the feasibility of producing face shield frames for use during the pandemic.",
    "tesseractProjectDetail5": "The main result of this collaboration with the university was the opportunity to teach a workshop for students and professors at UFPel, demonstrating best practices and techniques for preparing models for 3D printing.",
    "tesseractProjectDetail6": "Personally, I also organized part of the material produced into posts on my personal Instagram page, Tesseract_3D, which can be accessed by",
    "tesseractClickHere":"Clicking Here",
    "tesseractFigCaption":"Models printed with the EasyThreed"
}