{
  "greetings": "Olá Mundo!",
  "settingTitle": "Opções",
  "language": "Idioma",
  "theme": "Tema",
  "detail": "Mais Detalhes",
  "exampleDetail": "Esse é um texto detalhado.",
  "detailHelpText": "Essa opção serve para revelar ou ocultar outros detalhes sobre minha vida profissional, além de hobbies e outras experiências não diretamente ligadas ao campo da tecnologia.",
  "stack": "Minha Stack",
  "tools":"OUTROS",

  "myServices":"Meus Serviços",
    "makeSiteService":"Criação de WebSites",
    "freeLanceService":"Freelance sob Demanda",
    "makeDocService":"Documentação Técnica",
    "maintenanceService":"Manutenção de WebSites",

  "contact":"Contato",
  "contactFragment1": "Ou copie clicando em",
  "contactFragment2": "ou",
  "copied":"Copiado",
  "phone":"Telefone",


  "portfolioHeader": "Meus Projetos",
  
  "vanillaJSDescription":"Seção destinada aos meus projetos utilizando tecnologias básicas como HTML, CSS e JavaScript.",
  "reactJSDescription":"Seção destinada aos meus projetos utilizando tecnologias como React, Styled Components, TypeScript e outros.",

  "projectDetails": "Clique para mais Detalhes",
  "projectTechs": "Tecnologias",
  "previewButton":"Prévia",
  "repoButton":"Projeto",
    
    "unknownProject":"Projeto não encontrado.",

    "iFoodProject":"Este projeto foi desenvolvido durante a trilha de Desenvolvimento Front-End do curso Ada.Tech...",
    "iFoodProjectFullDescription":"Este projeto foi desenvolvido durante a trilha de Desenvolvimento Front-End do curso Ada.Tech. A proposta deste exercício, era a emulação de uma landing page para o Ifood, contando com o uso de tecnologias essenciais para o desenvolvimento front-end, como HTML e CSS. Seguindo um padrão de página única, também conhecido como SPA, a ideia foi criar uma estrutura responsiva, que servisse para o desenvolvimento de técnicas fundamentais de desenvolvimento. É importante destacar ainda, sua característica estática, visto que o exercício foi realizado sem a adoção de JavaScript em seu desenvolvimento.",
    
    "chaveiroGelsonProject":"Meu primeiro projeto comercial. Destinado à apresentar os serviços da empresa...",
    "chaveiroGelsonProjectFullDescription":"Meu primeiro projeto comercial. Destinado à apresentar os serviços da empresa. A proposta do projeto era, além de fornecer um cartão de visitas para a empresa Chaveiro Gelson, com seus serviços prestados e localização, disponibilizar também um sistema simples e eficiente para a realização de orçamentos. Para tal, foi utilizada a api do WhatsApp, onde através de um sistema de cartões, o cliente em visita à página, poderia construir um orçamento bem estruturado, o qual seria solicitado através do WhatsApp da empresa. Toda manipulação da página foi realizada com JavaScript 'puro'",

    "toDoProject":"Este projeto foi desenvolvido como um exercício em grupo, durante o curso da Ada.Tech...",
    "toDoProjectFullDescription":"Este projeto foi desenvolvido como um exercício em grupo, durante o curso da Ada.Tech. Durante o módulo de front-end dinâmico, foi proposto que cada trio desenvolvesse um web app de ToDo. Em parceria com meus colegas Rodrigo Silva e Wild Barreto, desenvolvemos um sistema simples, que além de permitir o cadastro de tarefas, possibilita a edição, conclusão e exclusão de tarefas, com o diferencial de contar com um armazenamento persistente, fazendo uso do localStorage do navegador para a persistência de dados.",

    "thisPortfolioProject":"(...) construída não apenas pensando em demonstrar a progressão da minha habilidade com uso do React... ",
    "thisPortfolioProjectFullDescription":"Meu projeto mais recente, esta mesma página, foi construída não apenas pensando em demonstrar a progressão da minha habilidade com uso do React, mas principalmente demonstrar outros aspectos que vão além do 'Lucas Desenvolvedor'. Além de contar com o uso mais aprofundado do React, a página foi construída utilizando bibliotecas como o typeIt, animações em CSS, tudo para trazer um maior dinamismo. O CSS foi todo trabalhado com styled components e foi feita uma ampla utilização de contextos, tanto no que tange a tradução da página, como estilização e até mesmo apresentação de seções não diretamente ligadas ao meu trabalho como desenvolvedor. Além disso, houve grande preocupação em trabalhar a responsividade da página, de forma que ela ficou adequada a qualquer tipo de tela. ",

    "todoTrackerProject":"O To-do Tracker foi a evolução natural dos meus trabalhos anteriores sobre todo list...",
    "todoTrackerProjectFullDescription":"O To-do Tracker foi a evolução natural dos meus trabalhos anteriores sobre todo list. Nele tive a oportunidade de aprofundar meus conhecimentos em React, ao passo em que desenvolvia uma ferramenta útil para continuar meus estudos enquanto desenvolvedor. A proposta por trás desse App, é não apenas poder organizar listas de tarefas em seus respectivos projetos e/ou trabalhos, mas também rastrear (manualmente) o tempo dedicado a cada tarefa, além de ser possível visualizar o tempo total de projeto/trabalho, a partir da somatória dos tempos acumulados em cada tarefa. Por fim, mas não menos importante, é possível realizar estimativas de precificação para os trabalhos e realizar a filtragem de tarefas por data, com auxílio do react-calendar.",

    "portfolioV01Project":"A antiga versão do meu Portfolio, foi minha primeira grande tentativa com o React.",
    "portfolioV01ProjectFullDescription":"A antiga versão do meu Portfolio, foi minha primeira grande tentativa com o React. Na época ainda contava com um conhecimento muito superficial da biblioteca, o que ocasionou uso frequente de manipulações diretamente no DOM com Javascript vanilla, mas ainda assim, obtive um resultado relativamente satisfatório na sua construção. O projeto foi originalmente hospetado no githubpages e essencialmente foi estruturado na forma de uma página única, com navegação através dos ids de seção.",

  "resumeTitle":"Sobre Mim",

  "cvLink":"https://drive.google.com/file/d/1ViWsThSqM2e8LSjCduCD6tGsgpDMFtA-/view?usp=sharing",

  "aboutMeSection":"Apresentação",
  "aboutMe": "Sou desenvolvedor web de Pelotas, RS, com formação em técnico de edificações e arquitetura, mas sempre focado em tecnologia. Ao longo da minha trajetória, explorei a impressão 3D e aprimorei habilidades de resolução de problemas. Recentemente, conclui o curso de Front-End Development na Ada.Tech e também fiz a introdução ao desenvolvimento web pela Faculdade Descomplica. Sou curioso e generalista, com experiência em HTML5, CSS3, JavaScript, React, Styled Components e BootStrap.",

  "educationSection":"Formação",

    "educationDegree":"Bacharelado em Arquitetura e Urbanismo",
    "educationDegreeInstituition":"Universidade Federal de Pelotas",
    "educationDegreeYear":"(2013 - 2023)",
    "educationDegreeDetail":"Formação como Arquiteto e Urbanista, com ampla experiência no campo do urbanismo, especialmente na utilização de tecnologias SIG para mapeamento georreferenciado.",

    "educationTechnical":"Técnico em Edificações",
    "educationTechnicalInstituition":"Instituto Federal Sul-Rio-Grandense",
    "educationTechnicalYear":"(2009 - 2013)",
    "educationTechnicalDetail":"Formação como técnico em edificações, cursada no formato integrado ao ensino médio.",

  "professionalSection":"Experiência Profissional",
    
    "itTechnician":"Técnico de Informática", 
    "itTechnicianCompany":"Autônomo",
    "itTechnicianYear":"(2022 - Presente)",
    "itTechnicianDetail":"Serviços para Desktops e Notebooks: Formatação e Recondicionamento, Montagem, Limpeza e Manutenção.",
    
    "operationalAssistant":"Assistente Operacional",
    "operationalAssistantCompany":"Empresa Brasileira de Correios e Telégrafos",
    "operationalAssistantYear":"(2024 - 2025)",
    "operationalAssistantDetail":"Auxílio na triagem e logística para distribuição de livros didáticos para escolas municipais e estaduais de Pelotas e região.",

    "mailCarrier":"Carteiro",
    "mailCarrierCompany":"Empresa Brasileira de Correios e Telégrafos",
    "mailCarrierYear":"(2024)",
    "mailCarrierDetail":"Atuação como entregador de encomendas e correspondências, além de auxiliar na triagem de pacotes, tanto para distribuição dentro da cidade de Pelotas quanto para despacho para outros locais.",

    "pontoX":"Estagiário",
    "pontoXCompany":"Ponto X - Arquitetura",
    "pontoXYear":"(2021 - 2022)",
    "pontoXDetail":"Execução de desenhos técnicos, projetos de arquitetura e interiores, modelagem 3D e renderização, além da coordenação da equipe de estagiários.",

    "gelsonProject":"Website do Chaveiro Gelson",
    "gelsonProjectDetail":"Página desenvolvida com tecnologias vanilla (HTML, CSS e JavaScript puro) para apresentação dos serviços da empresa, contando também com uma ferramenta para facilitar o processo de orçamento dos clientes por meio da API do WhatsApp.",

    "gelsonCompany":"Atendente e Chaveiro",
    "gelsonCompanyCompany":"Chaveiro Gelson",
    "gelsonCompanyYear":"(2019 - 2021)",
    "gelsonCompanyDetail":"Atendimento no balcão, cópia de chaves e abertura de fechaduras residenciais e automotivas.",

    "internUrbanMetrics":"Estagiário Acadêmico - UrbanMetrics Help",
    "internUrbanMetricsCompany":"Laboratório de Urbanismo FAUrb",
    "internUrbanMetricsYear":"(2020 - 2021)",
    "internUrbanMetricsDetail":"Coautoria, redação e edição do Help para o software UrbanMetrics, baseado nos estudos do professor Maurício Polidori sobre medidas topológicas urbanas.",
    "helpAccess":"Clique aqui para acessar o Help.",

    "gersonZaffalon":"Estagiário",
    "gersonZaffalonCompany":"Gerson Zaffalon - Arquitetura",
    "gersonZaffalonYear":"(2019 - 2020)",
    "gersonZaffalonDetail":"Execução de desenhos técnicos, projetos de arquitetura e interiores, modelagem 3D e renderização.",

    "hervalPlanning":"Estagiário Acadêmico - Planejamento Urbano de Herval",
    "hervalPlanningCompany":"Laboratório de Urbanismo FAUrb",
    "hervalPlanningYear":"(2019)",
    "hervalPlanningDetail":"Realização de levantamentos de campo, estudos de dados populacionais e demográficos, bem como a criação de mapas e produção de conteúdo georreferenciado em parceria com a prefeitura de Herval.",

    "fuelStation":"Frentista",
    "fuelStationCompany":"Posto da Rótula",
    "fuelStationYear":"(2018 - 2019)",
    "fuelStationDetail":"Atendimento ao público. Abastecimento e limpeza de veículos.",

    "candiotaPlanning":"Estagiário - Planejamento Urbano de Candiota",
    "candiotaPlanningCompany":"Laboratório de Urbanismo FAUrb",
    "candiotaPlanningYear":"(2018)",
    "candiotaPlanningDetail":"Realização de levantamentos de campo, estudos de dados populacionais e demográficos, bem como a criação de mapas e produção de conteúdo georreferenciado em parceria com a prefeitura de Candiota.",

    "chuyPlanning":"Estagiário - Planejamento Urbano de Chuy",
    "chuyPlanningCompany":"Laboratório de Urbanismo FAUrb",
    "chuyPlanningYear":"(2017)",
    "chuyPlanningDetail":"Realização de levantamentos de campo, estudos de dados populacionais e demográficos, bem como a criação de mapas e produção de conteúdo georreferenciado em parceria com a prefeitura de Chuy.",

    "internLab":"Estagiário - Assistente de Laboratório",
    "internLabCompany":"Laboratório de Urbanismo FAUrb",
    "internLabYear":"(2016)",
    "internLabDetail":"Manutenção e assistência no uso de computadores e equipamentos laboratoriais, além da gestão de inventário e controle de acesso de professores e alunos.",

    "atelieIntern":"Estagiário",
    "atelieInternCompany":"Ateliê Arquitetura",
    "atelieInternYear":"(2014)",
    "atelieInternDetail":"Execução de desenhos técnicos, projetos de arquitetura e interiores, modelagem 3D e renderização.",

    "martinsIntern":"Estagiário",
    "martinsInternCompany":"Escritório do Engenheiro Martins",
    "martinsInternYear":"(2012 - 2013)",
    "martinsInternDetail":"Desenvolvimento de desenhos técnicos. Execução de processamento de dados SIG e organização de documentação para regularização junto ao INCRA.",

  "freeEducationSection":"Cursos e Certificações",
  "certificateAccess":"Clique aqui para os Certificados.",

    "adaTech": "Vem Ser Tech - Trilha de Desenvolvimento Front-End",
    "adaTechCompany": "Ada.Tech",
    "adaTechYear": "(2023 - 2024)",
    "adaTechDetail": "Curso abrangente, cobrindo as disciplinas de Projeto Web Estático e Dinâmico, incluindo o uso de tecnologias como TypeScript, Bootstrap e React.",

    "descomplica": "Introdução ao Desenvolvimento Front-End",
    "descomplicaCompany": "Faculdade Descomplica",
    "descomplicaYear": "(2023)",
    "descomplicaDetail": "Introdução ao Desenvolvimento Web, com enfoque especial em páginas estáticas e tecnologias essenciais como HTML, CSS e JavaScript.",

    "origamidUIBegin": "UI Design para Iniciantes",
    "origamidUIBeginCompany":"Origamid",
    "origamidUIBeginYear":"(2024)",
    "origamidUIBeginDetail":"Curso de UI Design para iniciantes, abordando conceitos básicos e avançados de design de interface, começando do zero e utilizando ferramentas como Figma para a criação de protótipos.",

  "skillsSection":"Minhas Habilidades",
    "hardSkills":"Técnicas",
    "softSkills":"Sociais",

    "softSkillResilience": "Resiliência",
    "softSkillResilienceDetail": "Adaptabilidade e perseverança para transformar desafios em oportunidades, mantendo o foco em soluções eficazes e aprendizado contínuo.",
    "softSkillTeamWork": "Trabalho em Equipe",
    "softSkillTeamWorkDetail": "Colaboração eficaz, comunicação clara e comprometimento com objetivos coletivos, sempre buscando um ambiente produtivo e harmônico.",
    "softSkillGeneralism": "Generalismo",
    "softSkillGeneralismDetail": "Versátil e adaptável, com um conhecimento amplo que permite a resolução eficaz de problemas em diferentes áreas.",
    "softSkillOrganization": "Senso de Organização",
    "softSkillOrganizationDetail": "Capacidade de estruturar tarefas e gerenciar o tempo de forma eficaz, garantindo que os processos fluam de maneira tranquila e as prioridades sejam atendidas sem comprometer a qualidade.",
    "softSkillAccountability": "Responsabilidade",
    "softSkillAccountabilityDetail": "Comprometimento em cumprir tarefas com responsabilidade, garantindo que os objetivos sejam alcançados e assumindo a responsabilidade pelos resultados e decisões.",
    "softSkillsLanguage":"Idiomas",
    "softSkillsLanguageDetail":"Além do Português, meu idioma nativo, tenho nível intermediário em Inglês e Espanhol.",

  "personalProjects":"Hobbies e Projetos Pessoais",
    "bgdProject":"BoardGameDay!",
    "bgdProjectDetail1":"Desde muito jovem, sempre gostei de jogos de todos os gêneros. Com a chegada da pandemia em 2020, e suas restrições, o gosto por jogos de tabuleiro se intensificou.",
    "bgdProjectDetail2":"Durante o período de reclusão em casa com meus familiares, iniciei a construção de uma grande coleção. Isto, somado às visitas a uma loja de jogos de mesa local (que voltaram a ser frequentes com o fim da pandemia), Cúpula do Trovão, foi o gatilho perfeito para a criação do evento 'BoardGameDay', que, salvo exceções, ocorre uma vez ao mês nessa mesma loja.",
    "bgdProjectDetail3":"O projeto é organizado em parceria com meu amigo Luca e a gerência da loja, que disponibiliza o espaço para que possamos reunir amantes do hobby e também apresentá-lo a novos jogadores.",
    "bgdProjectDetail4":"Reconheço que a participação no hobby me trouxe diversos benefícios, além de ser uma ótima 'válvula de escape', é também uma excelente oportunidade para desenvolver habilidades sociais, além de trabalhar o raciocínio lógico e memorização.",
    "bgdFigCaption":"Acervo disponibilizado no Evento.",

  "tesseractProject": "Tesseract_Lab",
    "tesseractProjectDetail1": "Durante a pandemia, aprofundei meus estudos sobre impressão 3D, especificamente no modelo FDM (Fused Deposition Modeling ou Modelagem por Deposição Fundida).",
    "tesseractProjectDetail2": "Comecei com uma impressora simples, a EasyThreed X1, que trabalhava exclusivamente com filamentos de PLA, material que possui uma temperatura de fusão média de 190°C. Esse equipamento básico não contava com mesa aquecida nem um sistema de segurança contra entupimentos, o que mais tarde resultou em um defeito sério no motor.",
    "tesseractProjectDetail3": "Posteriormente, tive a oportunidade de trabalhar em parceria com a Cúpula do Trovão (a mesma loja de jogos mencionada anteriormente) no desenvolvimento de miniaturas para jogos de RPG, utilizando a impressora Ender-3, um dos modelos de entrada mais populares na época.",
    "tesseractProjectDetail4": "Paralelamente, também tive contato com um equipamento ainda mais avançado, a GT-Max3D H5 CORE, que possuía um volume de impressão muito maior e uma interface sofisticada para gerenciamento da impressão em tempo real. Essa experiência surgiu de um trabalho em parceria com meu curso de Arquitetura e Urbanismo, que tinha dois objetivos principais: aprofundar o conhecimento sobre o equipamento para compartilhá-lo com futuras gerações de alunos e avaliar a viabilidade da produção de armações para máscaras face shield durante o período pandêmico.",
    "tesseractProjectDetail5": "O principal fruto desse trabalho em parceria com a faculdade foi a oportunidade que tive de ministrar um minicurso para alunos e professores da UFPel, demonstrando boas práticas e técnicas de tratamento dos modelos para impressão 3D.",
    "tesseractProjectDetail6": "Pessoalmente, também organizei parte do material produzido em postagens na minha página pessoal do Instagram, a Tesseract_3D, a qual pode ser acessada",
    "tesseractClickHere":"Clicando Aqui",
    "tesseractFigCaption":"Modelos impressos com a EasyThreed."

}